# SheetMetalArea Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..SheetMetalArea Property
FabricationPart Class See Also
---
The sheet metal area of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double SheetMetalArea { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SheetMetalArea As Double
	Get
```

Visual C++
---
```text
public:
property double SheetMetalArea {
	double get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace